Revit 2027 API
KeyBasedTreeEntriesLoadContent.GetLoadResults Method
 Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeyBasedTreeEntriesLoadResults GetLoadResults()
Public Function GetLoadResults As KeyBasedTreeEntriesLoadResults
public:
KeyBasedTreeEntriesLoadResults^ GetLoadResults()
member GetLoadResults : unit -> KeyBasedTreeEntriesLoadResults
Return Value
KeyBasedTreeEntriesLoadResults
 A copy of a KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
Remarks
 IExternalResourceServers can use this object to report data and results back to Revit from their LoadResource methods.
See Also
Reference
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace